app/Models/ClimaModel.php

SELECT `ubicacion`
FROM `clima`
GROUP BY `ubicacion`
---
    public function getUbicaciones(){
        $db = db_connect();

        $builder = $db->table('clima')->select('ubicacion')->groupBy('ubicacion');

        $query = $builder->get();

SELECT `latitud`
FROM `clima`
WHERE `fecha` >= '2024-03-01'
AND `fecha` <= '2024-04-06'
---
    public function getClimaByFecha($fechaIncial,$fechaFinal){
        // $request = request();
        // $fechaIncial = $request->getGet('fechaInicial');
        // $fechaFinal = $request->getGet('fechaFinal');

        $db = db_connect();
        $sql = $db->table('clima')
        ->select('latitud','longitud','fecha','hora','temperatura')
        ->where('fecha>=',$fechaIncial)
        ->where('fecha<=',$fechaFinal);
        $query = $sql->get();

SELECT *
FROM `clima`
WHERE `hora` = '11:02:59'
---
    public function getClimaByHora(string $hora)
    {
        $request = request();
        $db = db_connect();
        // Consulta los datos del clima para la hora especificada
        $sql = $db->table('clima')->where('hora', $hora);
        $query = $sql->get();

SELECT MIN(`temperatura`) AS `temperatura`
FROM `clima`
SELECT `hora`
FROM `clima`
ORDER BY `humedad` DESC
---
    public function getClimaExtremo()
    {
        $db = db_connect();

        // Consulta para obtener datos extremos del clima
        $climaExtremo = [
            'temperatura_maxima' => $db->table('clima')->selectMax('temperatura')->get()->getRow()->temperatura,
            'temperatura_minima' => $db->table('clima')->selectMin('temperatura')->get()->getRow()->temperatura,
            'hora_mas_lluviosa' => $db->table('clima')->select('hora')->orderBy('humedad', 'desc')->get()->getRow()->hora

SELECT *
FROM `clima`
WHERE `ubicacion` = 'San Liliana los bajos'
---
    public function getClimaPorUbicacion(string $ubicacion)
    {
        $db = db_connect();
        // Consulta los datos del clima para la ubicación especificada
        $sql = $db->table('clima')->where('ubicacion', $ubicacion);
        $query = $sql->get();

SELECT AVG(`temperatura`) AS `temperatura`
FROM `clima`
WHERE `fecha` >= '2024-03-04'
AND `fecha` <= '2024-03-18'
---
    public function getClimaPromedio(string $fechaInicio, string $fechaFin)
    {
        $db = db_connect();

        // Consulta los datos del clima para el período especificado
        $query = $db->table('clima')
                    ->selectAvg('temperatura')
                    ->where('fecha >=', $fechaInicio)
                    ->where('fecha <=', $fechaFin)
                    ->get();

SELECT *
FROM `clima`
WHERE `ubicacion` = 'Vieja Armenia'
AND `hora` = '18:52'
---
    public function getClimaPorHoraYUbicacion(string $ubicacion, string $hora)
    {
        $db = db_connect();

        // Consulta los datos del clima para la ubicación y hora especificadas
        $query = $db->table('clima')
                    ->where('ubicacion', $ubicacion)
                    ->where('hora', $hora)
                    ->get();

SELECT `latitud`, `longitud`
FROM `clima`
WHERE `ubicacion` = 'San Guillermo los bajos'
---
    public function getCoordenadasPorUbicacion(string $ubicacion)
    {
        $db = db_connect();

        // Consulta las coordenadas (latitud y longitud) para la ubicación especificada
        $query = $db->table('clima')
                    ->select('latitud, longitud')
                    ->where('ubicacion', $ubicacion)
                    ->get();

SELECT `sensacionTermica`, `fecha`, `hora`
FROM `clima`
WHERE `ubicacion` = 'San Liliana los bajos'
---
    public function getSensacionTermicaPorUbicacion(string $ubicacion)
    {
        $db = db_connect();

        // Consulta la sensación térmica, fecha y hora para la ubicación especificada
        $query = $db->table('clima')
                    ->select('sensacionTermica, fecha, hora')
                    ->where('ubicacion', $ubicacion)
                    ->get();